
public class MultiArray {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		 * 다중 배열 : 배열 내에 배열을 생성하는 구조로, Outer 배열은 전체 Row 수를, Inner 배열은 각 Row의 컬럼을 구성한다.
		 * 배열 내의 값은 Outer 내의 Inner 배열이 가지고 있다.
		 */

		
		//숙제
		/*
		 * 국영수의 과목 점수를 입력 받아서 총점 및 평균, 평점을 출력하는 클래스를 정의하세요.
		 * 조건1 : 최대한 메서드를 구현해보세요.
		 * 조건2 : 각 과목의 점수는 배열안에 넣으세요.
		 * 조건3 : 각 과목의 점수가 0~100 이 아닐 경우 틀리다는 메세지 출력 후 정상 값이 들어올 수 있도록 반복 시키세요.
		 * 평점은 90 이상은 A 인데, 98 이상은 +, 94 이하는 -, 80 은 B, 70은 C, 나머지 F 를 적용시키세요.
		 */
	}

}
